{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-18-fdff38ae9e52>\u00da\b<lambda>y\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape": null, "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 64, 64, 3]}, "class_name": "Lambda"}, {"config": {"activation": "relu", "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_1", "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 5, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 5, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_3", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_4", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 3, "border_mode": "valid", "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_5", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "input_dim": 64, "b_constraint": null, "name": "dense_1", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1164, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "input_dim": 1164, "b_constraint": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "input_dim": 100, "b_constraint": null, "name": "dense_3", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "input_dim": 50, "b_constraint": null, "name": "dense_4", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "tanh", "input_dim": 10, "b_constraint": null, "name": "dense_5", "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "trainable": true, "bias": true, "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}